Instructions to run to prepare the vignette (to run before installing the package)

- export R code
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
## devtools::build_vignettes("BuyseTest", quiet = FALSE) ## generate the META & DOC folder
library(butils.base)
setwd(pathGitHub())
extractRchunk(file = "./BuyseTest/inst/doc-software/overview.org",
              newfile = "./BuyseTest/vignettes/overview.pdf.asis",
              header = c("%\\VignetteIndexEntry{BuyseTest: overview}",
                         "%\\VignetteEngine{R.rsp::asis}",
                         "%\\VignetteKeyword{PDF}",
                         "%\\VignetteKeyword{vignette}",
                         "%\\VignetteKeyword{package}",
                         ""),
              overwrite = TRUE)
#+END_SRC

#+RESULTS:
: Loading required package: devtools
: Loading required package: usethis
: butils.base version 1.3
: 
: Attaching package: ‘butils.base’
: 
: The following object is masked _by_ ‘.GlobalEnv’:
: 
:     validCharacter

- move to directory containing the package, compress vignette pdf file, and copy to =doc= and =vignettes= directories
#+BEGIN_SRC shell
cd ~/Documents/GitHub/BuyseTest/inst/doc-software/
gs -sDEVICE=pdfwrite -dCompatibilityLevel=1.4 -dPDFSETTINGS=/printer -dNOPAUSE -dQUIET -dBATCH -sOutputFile=overview-compress.pdf overview.pdf
cp overview-compress.pdf ../../vignettes/overview.pdf 
cp overview.R ../../vignettes/overview.R 
#+END_SRC

#+RESULTS:

